
const SearchDistribution = {
    "2018": [
        {
            "id": "1320013",
            "label": "情報リテラシ実習"
        },
        {
            "id": "GA10101",
            "label": "情報社会と法制度"
        },
        {
            "id": "GA10201",
            "label": "知的財産概論"
        },
        {
            "id": "GA40303",
            "label": "ビジネスシステムデザインA"
        },
        {
            "id": "GA40403",
            "label": "ビジネスシステムデザインB"
        },
        {
            "id": "GE10101",
            "label": "知識情報概論"
        },
        {
            "id": "GE10201",
            "label": "哲学"
        },
        {
            "id": "GE10301",
            "label": "情報基礎"
        },
        {
            "id": "GE10413",
            "label": "情報基礎実習-1"
        },
        {
            "id": "GE10423",
            "label": "情報基礎実習-2"
        },
        {
            "id": "GE10612",
            "label": "プログラミング演習I-1"
        },
        {
            "id": "GE10622",
            "label": "プログラミング演習I-2"
        },
        {
            "id": "GE10712",
            "label": "プログラミング演習II-1"
        },
        {
            "id": "GE10722",
            "label": "プログラミング演習II-2"
        },
        {
            "id": "GE10732",
            "label": "プログラミング演習II-3"
        },
        {
            "id": "GE10801",
            "label": "情報数学"
        },
        {
            "id": "GE10911",
            "label": "統計"
        },
        {
            "id": "GE11012",
            "label": "知識情報演習I-1"
        },
        {
            "id": "GE11022",
            "label": "知識情報演習I-2"
        },
        {
            "id": "GE11112",
            "label": "知識情報演習II-1"
        },
        {
            "id": "GE11122",
            "label": "知識情報演習II-2"
        },
        {
            "id": "GE11212",
            "label": "知識情報演習III-1"
        },
        {
            "id": "GE11222",
            "label": "知識情報演習III-2"
        },
        {
            "id": "GE11512",
            "label": "専門英語A-1"
        },
        {
            "id": "GE11522",
            "label": "専門英語A-2"
        },
        {
            "id": "GE11532",
            "label": "専門英語A-3"
        },
        {
            "id": "GE11542",
            "label": "専門英語A-4"
        },
        {
            "id": "GE20101",
            "label": "情報システム概説"
        },
        {
            "id": "GE20201",
            "label": "基礎数学A"
        },
        {
            "id": "GE20301",
            "label": "基礎数学B"
        },
        {
            "id": "GE20401",
            "label": "量的調査法"
        },
        {
            "id": "GE20511",
            "label": "多変量解析"
        },
        {
            "id": "GE20601",
            "label": "情報探索論"
        },
        {
            "id": "GE20701",
            "label": "質的調査法"
        },
        {
            "id": "GE20801",
            "label": "情報行動論"
        },
        {
            "id": "GE20901",
            "label": "知識発見基礎論"
        },
        {
            "id": "GE21001",
            "label": "知識資源組織化論"
        },
        {
            "id": "GE21101",
            "label": "データベース概説"
        },
        {
            "id": "GE21201",
            "label": "コンピュータシステムとネットワーク"
        },
        {
            "id": "GE21301",
            "label": "自然言語解析基礎"
        },
        {
            "id": "GE21401",
            "label": "メディア社会学"
        },
        {
            "id": "GE21701",
            "label": "生涯学習と図書館"
        },
        {
            "id": "GE21812",
            "label": "テクスト解釈-1"
        },
        {
            "id": "GE21832",
            "label": "テクスト解釈-3"
        },
        {
            "id": "GE22001",
            "label": "図書館概論"
        },
        {
            "id": "GE22101",
            "label": "経営・組織論"
        },
        {
            "id": "GE40201",
            "label": "学習指導と学校図書館"
        },
        {
            "id": "GE40301",
            "label": "学校図書館メディアの構成"
        },
        {
            "id": "GE40401",
            "label": "読書と豊かな人間性"
        },
        {
            "id": "GE40501",
            "label": "情報メディアの活用"
        },
        {
            "id": "GE40603",
            "label": "インターンシップ"
        },
        {
            "id": "GE50301",
            "label": "知識情報特論I"
        },
        {
            "id": "GE50401",
            "label": "知識情報特論II"
        },
        {
            "id": "GE50712",
            "label": "専門英語B-1"
        },
        {
            "id": "GE50722",
            "label": "専門英語B-2"
        },
        {
            "id": "GE50732",
            "label": "専門英語B-3"
        },
        {
            "id": "GE50812",
            "label": "専門英語C-1"
        },
        {
            "id": "GE50822",
            "label": "専門英語C-2"
        },
        {
            "id": "GE50832",
            "label": "専門英語C-3"
        },
        {
            "id": "GE51018",
            "label": "卒業研究"
        },
        {
            "id": "GE60103",
            "label": "知識科学実習"
        },
        {
            "id": "GE60201",
            "label": "テクニカルコミュニケーション"
        },
        {
            "id": "GE60501",
            "label": "知識論"
        },
        {
            "id": "GE60601",
            "label": "知識形成論"
        },
        {
            "id": "GE61001",
            "label": "コミュニティ情報論"
        },
        {
            "id": "GE61101",
            "label": "図書館建築論"
        },
        {
            "id": "GE61201",
            "label": "知識構造化法"
        },
        {
            "id": "GE61301",
            "label": "情報評価"
        },
        {
            "id": "GE61501",
            "label": "データマイニング"
        },
        {
            "id": "GE61701",
            "label": "サイエンスコミュニケーション"
        },
        {
            "id": "GE62001",
            "label": "生命情報学"
        },
        {
            "id": "GE62101",
            "label": "知識コミュニケーション"
        },
        {
            "id": "GE62201",
            "label": "メディア社会文化論"
        },
        {
            "id": "GE62301",
            "label": "ソーシャルメディア分析"
        },
        {
            "id": "GE70103",
            "label": "知識情報システム実習"
        },
        {
            "id": "GE70201",
            "label": "情報サービスシステム"
        },
        {
            "id": "GE70301",
            "label": "ディジタルドキュメント"
        },
        {
            "id": "GE70401",
            "label": "ディジタルライブラリ"
        },
        {
            "id": "GE70501",
            "label": "情報検索システム"
        },
        {
            "id": "GE70601",
            "label": "Webプログラミング"
        },
        {
            "id": "GE70701",
            "label": "マルチメディアシステム"
        },
        {
            "id": "GE70801",
            "label": "データ表現と処理"
        },
        {
            "id": "GE70901",
            "label": "データベース技術"
        },
        {
            "id": "GE71001",
            "label": "情報デザインとインタフェース"
        },
        {
            "id": "GE71201",
            "label": "知識資源の分析"
        },
        {
            "id": "GE71501",
            "label": "クラウドコンピューティング"
        },
        {
            "id": "GE71701",
            "label": "テキスト処理"
        },
        {
            "id": "GE72001",
            "label": "ソフトウェア工学"
        },
        {
            "id": "GE72201",
            "label": "アーカイブズの利用"
        },
        {
            "id": "GE72501",
            "label": "メディアアート"
        },
        {
            "id": "GE80103",
            "label": "情報資源経営実習"
        },
        {
            "id": "GE80201",
            "label": "図書館論"
        },
        {
            "id": "GE80301",
            "label": "学術情報基盤論"
        },
        {
            "id": "GE80401",
            "label": "経営情報システム論"
        },
        {
            "id": "GE80501",
            "label": "情報サービス経営論"
        },
        {
            "id": "GE80801",
            "label": "情報サービス構成論"
        },
        {
            "id": "GE80901",
            "label": "コレクションとアクセス"
        },
        {
            "id": "GE81101",
            "label": "メディア教育の実践と評価"
        },
        {
            "id": "GE81201",
            "label": "学校図書館論"
        },
        {
            "id": "GE81301",
            "label": "情報法"
        },
        {
            "id": "GE81401",
            "label": "知的財産権論A"
        },
        {
            "id": "GE81901",
            "label": "図書館文化史論"
        },
        {
            "id": "GE82101",
            "label": "日本図書学"
        },
        {
            "id": "GE82201",
            "label": "アーカイブズの構築"
        },
        {
            "id": "GE82501",
            "label": "映像メディア論"
        },
        {
            "id": "GE82601",
            "label": "パブリックガバナンス"
        }
    ],
    "2019": [
        {
            "id": "GA10101",
            "label": "情報社会と法制度"
        },
        {
            "id": "GA10201",
            "label": "知的財産概論"
        },
        {
            "id": "GA14111",
            "label": "知識情報概論"
        },
        {
            "id": "GA14121",
            "label": "知識情報概論"
        },
        {
            "id": "GA14201",
            "label": "知識情報システム概説"
        },
        {
            "id": "GA14301",
            "label": "図書館概論"
        },
        {
            "id": "GA15141",
            "label": "情報数学A"
        },
        {
            "id": "GA15241",
            "label": "線形代数A"
        },
        {
            "id": "GA15341",
            "label": "微分積分A"
        },
        {
            "id": "GA18132",
            "label": "プログラミング入門"
        },
        {
            "id": "GA18142",
            "label": "プログラミング入門"
        },
        {
            "id": "GA40303",
            "label": "ビジネスシステムデザインA"
        },
        {
            "id": "GA40403",
            "label": "ビジネスシステムデザインB"
        },
        {
            "id": "GE10201",
            "label": "哲学"
        },
        {
            "id": "GE10632",
            "label": "プログラミング演習I"
        },
        {
            "id": "GE10712",
            "label": "プログラミング演習II-1"
        },
        {
            "id": "GE10732",
            "label": "プログラミング演習II-3"
        },
        {
            "id": "GE10811",
            "label": "情報数学A"
        },
        {
            "id": "GE10911",
            "label": "統計"
        },
        {
            "id": "GE11012",
            "label": "知識情報演習I-1"
        },
        {
            "id": "GE11022",
            "label": "知識情報演習I-2"
        },
        {
            "id": "GE11112",
            "label": "知識情報演習II-1"
        },
        {
            "id": "GE11122",
            "label": "知識情報演習II-2"
        },
        {
            "id": "GE11212",
            "label": "知識情報演習III-1"
        },
        {
            "id": "GE11222",
            "label": "知識情報演習III-2"
        },
        {
            "id": "GE11512",
            "label": "専門英語A"
        },
        {
            "id": "GE11522",
            "label": "専門英語A"
        },
        {
            "id": "GE11532",
            "label": "専門英語A"
        },
        {
            "id": "GE12112",
            "label": "アカデミックスキルズ"
        },
        {
            "id": "GE12122",
            "label": "アカデミックスキルズ"
        },
        {
            "id": "GE12132",
            "label": "アカデミックスキルズ"
        },
        {
            "id": "GE12142",
            "label": "アカデミックスキルズ"
        },
        {
            "id": "GE20211",
            "label": "基礎数学A"
        },
        {
            "id": "GE20401",
            "label": "量的調査法"
        },
        {
            "id": "GE20511",
            "label": "多変量解析"
        },
        {
            "id": "GE20601",
            "label": "情報探索論"
        },
        {
            "id": "GE20701",
            "label": "質的調査法"
        },
        {
            "id": "GE20801",
            "label": "情報行動論"
        },
        {
            "id": "GE20901",
            "label": "知識発見基礎論"
        },
        {
            "id": "GE21001",
            "label": "知識資源組織化論"
        },
        {
            "id": "GE21101",
            "label": "データベース概説"
        },
        {
            "id": "GE21201",
            "label": "コンピュータシステムとネットワーク"
        },
        {
            "id": "GE21301",
            "label": "自然言語解析基礎"
        },
        {
            "id": "GE21401",
            "label": "メディア社会学"
        },
        {
            "id": "GE21601",
            "label": "公共経済学"
        },
        {
            "id": "GE21701",
            "label": "生涯学習と図書館"
        },
        {
            "id": "GE21812",
            "label": "テクスト解釈-1"
        },
        {
            "id": "GE21832",
            "label": "テクスト解釈-3"
        },
        {
            "id": "GE22101",
            "label": "経営・組織論"
        },
        {
            "id": "GE22201",
            "label": "機械学習"
        },
        {
            "id": "GE22301",
            "label": "映像メディア概論"
        },
        {
            "id": "GE33023",
            "label": "知的探求の世界I-2"
        },
        {
            "id": "GE40201",
            "label": "学習指導と学校図書館"
        }
    ],
    "2014": [
        {
            "id": "1320013",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320023",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320033",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320043",
            "label": "情報リテラシ実習"
        },
        {
            "id": "GA10101",
            "label": "情報社会と法制度"
        },
        {
            "id": "GA10201",
            "label": "知的財産概論"
        },
        {
            "id": "GE10101",
            "label": "知識情報概論"
        },
        {
            "id": "GE10201",
            "label": "哲学"
        },
        {
            "id": "GE10301",
            "label": "情報基礎"
        },
        {
            "id": "GE10413",
            "label": "情報基礎実習-1"
        },
        {
            "id": "GE10423",
            "label": "情報基礎実習-2"
        },
        {
            "id": "GE10612",
            "label": "プログラミング演習I-1"
        },
        {
            "id": "GE10622",
            "label": "プログラミング演習I-2"
        },
        {
            "id": "GE10712",
            "label": "プログラミング演習II-1"
        },
        {
            "id": "GE10722",
            "label": "プログラミング演習II-2"
        },
        {
            "id": "GE10732",
            "label": "プログラミング演習II-3"
        },
        {
            "id": "GE10801",
            "label": "情報数学"
        },
        {
            "id": "GE10911",
            "label": "統計"
        },
        {
            "id": "GE11012",
            "label": "知識情報演習I-1"
        },
        {
            "id": "GE11022",
            "label": "知識情報演習I-2"
        },
        {
            "id": "GE11112",
            "label": "知識情報演習II-1"
        },
        {
            "id": "GE11122",
            "label": "知識情報演習II-2"
        },
        {
            "id": "GE11212",
            "label": "知識情報演習III-1"
        },
        {
            "id": "GE11222",
            "label": "知識情報演習III-2"
        },
        {
            "id": "GE11512",
            "label": "専門英語A-1"
        },
        {
            "id": "GE11522",
            "label": "専門英語A-2"
        },
        {
            "id": "GE11532",
            "label": "専門英語A-3"
        },
        {
            "id": "GE11542",
            "label": "専門英語A-4"
        },
        {
            "id": "GE20101",
            "label": "情報システム概説"
        },
        {
            "id": "GE20201",
            "label": "基礎数学A"
        },
        {
            "id": "GE20301",
            "label": "基礎数学B"
        },
        {
            "id": "GE20401",
            "label": "量的調査法"
        },
        {
            "id": "GE20501",
            "label": "多変量解析-1"
        },
        {
            "id": "GE20601",
            "label": "情報探索論"
        },
        {
            "id": "GE20701",
            "label": "質的調査法"
        },
        {
            "id": "GE20801",
            "label": "情報行動論"
        },
        {
            "id": "GE20901",
            "label": "知識発見基礎論"
        },
        {
            "id": "GE21001",
            "label": "知識資源組織化論"
        },
        {
            "id": "GE21101",
            "label": "データベース概説"
        },
        {
            "id": "GE21201",
            "label": "コンピュータシステムとネットワーク"
        },
        {
            "id": "GE21301",
            "label": "自然言語解析基礎"
        },
        {
            "id": "GE21401",
            "label": "メディア社会学"
        },
        {
            "id": "GE21501",
            "label": "経営・組織論"
        },
        {
            "id": "GE21601",
            "label": "公共経済学"
        },
        {
            "id": "GE21701",
            "label": "生涯学習と図書館"
        },
        {
            "id": "GE21812",
            "label": "テクスト解釈-1"
        },
        {
            "id": "GE21822",
            "label": "テクスト解釈-2"
        },
        {
            "id": "GE21832",
            "label": "テクスト解釈-3"
        },
        {
            "id": "GE22001",
            "label": "図書館概論"
        },
        {
            "id": "GE40201",
            "label": "学習指導と学校図書館"
        },
        {
            "id": "GE40301",
            "label": "学校図書館メディアの構成"
        },
        {
            "id": "GE40401",
            "label": "読書と豊かな人間性"
        },
        {
            "id": "GE40501",
            "label": "情報メディアの活用"
        },
        {
            "id": "GE40603",
            "label": "インターンシップ"
        },
        {
            "id": "GE50301",
            "label": "知識情報特論I"
        },
        {
            "id": "GE50401",
            "label": "知識情報特論II"
        },
        {
            "id": "GE50712",
            "label": "専門英語B-1"
        },
        {
            "id": "GE50722",
            "label": "専門英語B-2"
        },
        {
            "id": "GE50732",
            "label": "専門英語B-3"
        },
        {
            "id": "GE50812",
            "label": "専門英語C-1"
        },
        {
            "id": "GE50822",
            "label": "専門英語C-2"
        },
        {
            "id": "GE50832",
            "label": "専門英語C-3"
        },
        {
            "id": "GE51018",
            "label": "卒業研究"
        },
        {
            "id": "GE60103",
            "label": "知識科学実習"
        },
        {
            "id": "GE60201",
            "label": "テクニカルコミュニケーション"
        },
        {
            "id": "GE60301",
            "label": "医療情報論"
        },
        {
            "id": "GE60401",
            "label": "特許情報論"
        },
        {
            "id": "GE60501",
            "label": "知識論"
        },
        {
            "id": "GE60701",
            "label": "レファレンスサイエンス"
        },
        {
            "id": "GE60801",
            "label": "学術メディア論"
        },
        {
            "id": "GE61001",
            "label": "コミュニティ情報論"
        },
        {
            "id": "GE61101",
            "label": "図書館建築論"
        },
        {
            "id": "GE61201",
            "label": "知識構造化法"
        },
        {
            "id": "GE61301",
            "label": "情報評価"
        },
        {
            "id": "GE61501",
            "label": "データマイニング"
        },
        {
            "id": "GE61601",
            "label": "ソフトコンピューティング"
        },
        {
            "id": "GE61701",
            "label": "サイエンスコミュニケーション"
        },
        {
            "id": "GE62001",
            "label": "生命情報学"
        },
        {
            "id": "GE62101",
            "label": "知識コミュニケーション"
        },
        {
            "id": "GE70103",
            "label": "知識情報システム実習"
        },
        {
            "id": "GE70201",
            "label": "情報サービスシステム"
        },
        {
            "id": "GE70301",
            "label": "ディジタルドキュメント"
        },
        {
            "id": "GE70401",
            "label": "ディジタルライブラリ"
        },
        {
            "id": "GE70501",
            "label": "情報検索システム"
        },
        {
            "id": "GE70601",
            "label": "Webプログラミング"
        },
        {
            "id": "GE70701",
            "label": "マルチメディアシステム"
        },
        {
            "id": "GE70801",
            "label": "データ表現と処理"
        },
        {
            "id": "GE70901",
            "label": "データベース技術"
        },
        {
            "id": "GE71001",
            "label": "情報デザインとインタフェース"
        },
        {
            "id": "GE71201",
            "label": "知識資源の分析"
        },
        {
            "id": "GE71301",
            "label": "知識資源の記述"
        },
        {
            "id": "GE71401",
            "label": "知識資源の用語管理"
        },
        {
            "id": "GE71501",
            "label": "クラウドコンピューティング"
        },
        {
            "id": "GE71701",
            "label": "テキスト処理"
        },
        {
            "id": "GE71801",
            "label": "データ構造とアルゴリズム"
        },
        {
            "id": "GE72001",
            "label": "ソフトウェア工学"
        },
        {
            "id": "GE72201",
            "label": "アーカイブズの利用"
        },
        {
            "id": "GE80103",
            "label": "情報経営・図書館実習"
        },
        {
            "id": "GE80201",
            "label": "図書館論"
        },
        {
            "id": "GE80301",
            "label": "学術情報基盤論"
        },
        {
            "id": "GE80401",
            "label": "経営情報システム論"
        },
        {
            "id": "GE80501",
            "label": "情報サービス経営論"
        },
        {
            "id": "GE80601",
            "label": "情報経済論"
        },
        {
            "id": "GE80701",
            "label": "パブリックガバナンス論"
        },
        {
            "id": "GE80801",
            "label": "情報サービス構成論"
        },
        {
            "id": "GE80901",
            "label": "コレクションとアクセス"
        },
        {
            "id": "GE81001",
            "label": "教育文化政策"
        },
        {
            "id": "GE81101",
            "label": "メディア教育の実践と評価"
        },
        {
            "id": "GE81201",
            "label": "学校図書館論"
        },
        {
            "id": "GE81301",
            "label": "情報法"
        },
        {
            "id": "GE81401",
            "label": "知的財産権論A"
        },
        {
            "id": "GE81501",
            "label": "知的財産権論B"
        },
        {
            "id": "GE81601",
            "label": "図書館情報法制度論"
        },
        {
            "id": "GE81701",
            "label": "メディア社会文化論"
        },
        {
            "id": "GE81901",
            "label": "図書館文化史論"
        },
        {
            "id": "GE82001",
            "label": "中国図書学"
        },
        {
            "id": "GE82101",
            "label": "日本図書学"
        },
        {
            "id": "GE82201",
            "label": "アーカイブズ学"
        }
    ],
    "2015": [
        {
            "id": "1320013",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320023",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320033",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320043",
            "label": "情報リテラシ実習"
        },
        {
            "id": "GA10101",
            "label": "情報社会と法制度"
        },
        {
            "id": "GA10201",
            "label": "知的財産概論"
        },
        {
            "id": "GE10101",
            "label": "知識情報概論"
        },
        {
            "id": "GE10201",
            "label": "哲学"
        },
        {
            "id": "GE10301",
            "label": "情報基礎"
        },
        {
            "id": "GE10413",
            "label": "情報基礎実習-1"
        },
        {
            "id": "GE10423",
            "label": "情報基礎実習-2"
        },
        {
            "id": "GE10612",
            "label": "プログラミング演習I-1"
        },
        {
            "id": "GE10622",
            "label": "プログラミング演習I-2"
        },
        {
            "id": "GE10712",
            "label": "プログラミング演習II-1"
        },
        {
            "id": "GE10722",
            "label": "プログラミング演習II-2"
        },
        {
            "id": "GE10732",
            "label": "プログラミング演習II-3"
        },
        {
            "id": "GE10801",
            "label": "情報数学"
        },
        {
            "id": "GE10911",
            "label": "統計"
        },
        {
            "id": "GE11012",
            "label": "知識情報演習I-1"
        },
        {
            "id": "GE11022",
            "label": "知識情報演習I-2"
        },
        {
            "id": "GE11112",
            "label": "知識情報演習II-1"
        },
        {
            "id": "GE11122",
            "label": "知識情報演習II-2"
        },
        {
            "id": "GE11212",
            "label": "知識情報演習III-1"
        },
        {
            "id": "GE11222",
            "label": "知識情報演習III-2"
        },
        {
            "id": "GE11512",
            "label": "専門英語A-1"
        },
        {
            "id": "GE11522",
            "label": "専門英語A-2"
        },
        {
            "id": "GE11532",
            "label": "専門英語A-3"
        },
        {
            "id": "GE11542",
            "label": "専門英語A-4"
        },
        {
            "id": "GE20101",
            "label": "情報システム概説"
        },
        {
            "id": "GE20201",
            "label": "基礎数学A"
        },
        {
            "id": "GE20301",
            "label": "基礎数学B"
        },
        {
            "id": "GE20401",
            "label": "量的調査法"
        },
        {
            "id": "GE20501",
            "label": "多変量解析"
        },
        {
            "id": "GE20511",
            "label": "多変量解析-2"
        },
        {
            "id": "GE20601",
            "label": "情報探索論"
        },
        {
            "id": "GE20701",
            "label": "質的調査法"
        },
        {
            "id": "GE20801",
            "label": "情報行動論"
        },
        {
            "id": "GE20901",
            "label": "知識発見基礎論"
        },
        {
            "id": "GE21001",
            "label": "知識資源組織化論"
        },
        {
            "id": "GE21101",
            "label": "データベース概説"
        },
        {
            "id": "GE21201",
            "label": "コンピュータシステムとネット"
        },
        {
            "id": "GE21301",
            "label": "自然言語解析基礎"
        },
        {
            "id": "GE21401",
            "label": "メディア社会学"
        },
        {
            "id": "GE21501",
            "label": "経営・組織論"
        },
        {
            "id": "GE21601",
            "label": "公共経済学"
        },
        {
            "id": "GE21701",
            "label": "生涯学習と図書館"
        },
        {
            "id": "GE21812",
            "label": "テクスト解釈-1"
        },
        {
            "id": "GE21822",
            "label": "テクスト解釈-2"
        },
        {
            "id": "GE21832",
            "label": "テクスト解釈-3"
        },
        {
            "id": "GE22001",
            "label": "図書館概論"
        },
        {
            "id": "GE31023",
            "label": "知的探求の世界I-2"
        },
        {
            "id": "GE32023",
            "label": "知的探求の世界II-2"
        },
        {
            "id": "GE40201",
            "label": "学習指導と学校図書館"
        },
        {
            "id": "GE40301",
            "label": "学校図書館メディアの構成"
        },
        {
            "id": "GE40401",
            "label": "読書と豊かな人間性"
        },
        {
            "id": "GE40501",
            "label": "情報メディアの活用"
        },
        {
            "id": "GE40603",
            "label": "インターンシップ"
        },
        {
            "id": "GE41001",
            "label": "知識情報学特別講義I"
        },
        {
            "id": "GE50501",
            "label": "知識情報特論III"
        },
        {
            "id": "GE50601",
            "label": "知識情報特論IV"
        },
        {
            "id": "GE50712",
            "label": "専門英語B-1"
        },
        {
            "id": "GE50722",
            "label": "専門英語B-2"
        },
        {
            "id": "GE50732",
            "label": "専門英語B-3"
        },
        {
            "id": "GE50812",
            "label": "専門英語C-1"
        },
        {
            "id": "GE50822",
            "label": "専門英語C-2"
        },
        {
            "id": "GE50832",
            "label": "専門英語C-3"
        },
        {
            "id": "GE51018",
            "label": "卒業研究"
        },
        {
            "id": "GE60103",
            "label": "知識科学実習"
        },
        {
            "id": "GE60201",
            "label": "テクニカルコミュニケーション"
        },
        {
            "id": "GE60301",
            "label": "医療情報論"
        },
        {
            "id": "GE60501",
            "label": "知識論"
        },
        {
            "id": "GE60701",
            "label": "レファレンスサイエンス"
        },
        {
            "id": "GE60801",
            "label": "学術メディア論"
        },
        {
            "id": "GE61001",
            "label": "コミュニティ情報論"
        },
        {
            "id": "GE61201",
            "label": "知識構造化法"
        },
        {
            "id": "GE61301",
            "label": "情報評価"
        },
        {
            "id": "GE61501",
            "label": "データマイニング"
        },
        {
            "id": "GE61701",
            "label": "サイエンスコミュニケーション"
        },
        {
            "id": "GE62001",
            "label": "生命情報学"
        },
        {
            "id": "GE62101",
            "label": "知識コミュニケーション"
        },
        {
            "id": "GE62201",
            "label": "メディア社会文化論"
        },
        {
            "id": "GE62301",
            "label": "ソーシャルメディア分析"
        },
        {
            "id": "GE70103",
            "label": "知識情報システム実習"
        },
        {
            "id": "GE70201",
            "label": "情報サービスシステム"
        },
        {
            "id": "GE70301",
            "label": "ディジタルドキュメント"
        },
        {
            "id": "GE70401",
            "label": "ディジタルライブラリ"
        },
        {
            "id": "GE70501",
            "label": "情報検索システム"
        },
        {
            "id": "GE70601",
            "label": "Webプログラミング"
        },
        {
            "id": "GE70701",
            "label": "マルチメディアシステム"
        },
        {
            "id": "GE70801",
            "label": "データ表現と処理"
        },
        {
            "id": "GE70901",
            "label": "データベース技術"
        },
        {
            "id": "GE71001",
            "label": "情報デザインとインタフェース"
        },
        {
            "id": "GE71201",
            "label": "知識資源の分析"
        },
        {
            "id": "GE71301",
            "label": "知識資源の記述"
        },
        {
            "id": "GE71401",
            "label": "知識資源の用語管理"
        },
        {
            "id": "GE71501",
            "label": "クラウドコンピューティング"
        },
        {
            "id": "GE71701",
            "label": "テキスト処理"
        },
        {
            "id": "GE72001",
            "label": "ソフトウェア工学"
        },
        {
            "id": "GE72201",
            "label": "アーカイブズの利用"
        },
        {
            "id": "GE72402",
            "label": "ディジタルキュレーション"
        },
        {
            "id": "GE80103",
            "label": "情報資源経営実習"
        },
        {
            "id": "GE80201",
            "label": "図書館論"
        },
        {
            "id": "GE80301",
            "label": "学術情報基盤論"
        },
        {
            "id": "GE80401",
            "label": "経営情報システム論"
        },
        {
            "id": "GE80501",
            "label": "情報サービス経営論"
        },
        {
            "id": "GE80601",
            "label": "情報経済論"
        },
        {
            "id": "GE80701",
            "label": "パブリックガバナンス論"
        },
        {
            "id": "GE80801",
            "label": "情報サービス構成論"
        },
        {
            "id": "GE80901",
            "label": "コレクションとアクセス"
        },
        {
            "id": "GE81001",
            "label": "教育文化政策"
        },
        {
            "id": "GE81101",
            "label": "メディア教育の実践と評価"
        },
        {
            "id": "GE81201",
            "label": "学校図書館論"
        },
        {
            "id": "GE81301",
            "label": "情報法"
        },
        {
            "id": "GE81401",
            "label": "知的財産権論A"
        },
        {
            "id": "GE81601",
            "label": "図書館情報法制度論"
        },
        {
            "id": "GE81901",
            "label": "図書館文化史論"
        },
        {
            "id": "GE82001",
            "label": "中国図書学"
        },
        {
            "id": "GE82101",
            "label": "日本図書学"
        },
        {
            "id": "GE82201",
            "label": "アーカイブズの構築"
        },
        {
            "id": "GE82501",
            "label": "映像メディア論"
        }
    ],
    "2017": [
        {
            "id": "1320013",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320023",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320033",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320043",
            "label": "情報リテラシ実習"
        },
        {
            "id": "GA10101",
            "label": "情報社会と法制度"
        },
        {
            "id": "GA10201",
            "label": "知的財産概論"
        },
        {
            "id": "GE10101",
            "label": "知識情報概論"
        },
        {
            "id": "GE10201",
            "label": "哲学"
        },
        {
            "id": "GE10301",
            "label": "情報基礎"
        },
        {
            "id": "GE10413",
            "label": "情報基礎実習-1"
        },
        {
            "id": "GE10423",
            "label": "情報基礎実習-2"
        },
        {
            "id": "GE10612",
            "label": "プログラミング演習I-1"
        },
        {
            "id": "GE10622",
            "label": "プログラミング演習I-2"
        },
        {
            "id": "GE10712",
            "label": "プログラミング演習II-1"
        },
        {
            "id": "GE10722",
            "label": "プログラミング演習II-2"
        },
        {
            "id": "GE10732",
            "label": "プログラミング演習II-3"
        },
        {
            "id": "GE10801",
            "label": "情報数学"
        },
        {
            "id": "GE10911",
            "label": "統計"
        },
        {
            "id": "GE11012",
            "label": "知識情報演習I-1"
        },
        {
            "id": "GE11022",
            "label": "知識情報演習I-2"
        },
        {
            "id": "GE11112",
            "label": "知識情報演習II-1"
        },
        {
            "id": "GE11122",
            "label": "知識情報演習II-2"
        },
        {
            "id": "GE11212",
            "label": "知識情報演習III-1"
        },
        {
            "id": "GE11222",
            "label": "知識情報演習III-2"
        },
        {
            "id": "GE11512",
            "label": "専門英語A-1"
        },
        {
            "id": "GE11522",
            "label": "専門英語A-2"
        },
        {
            "id": "GE11532",
            "label": "専門英語A-3"
        },
        {
            "id": "GE11542",
            "label": "専門英語A-4"
        },
        {
            "id": "GE20101",
            "label": "情報システム概説"
        },
        {
            "id": "GE20201",
            "label": "基礎数学A"
        },
        {
            "id": "GE20301",
            "label": "基礎数学B"
        },
        {
            "id": "GE20401",
            "label": "量的調査法"
        },
        {
            "id": "GE20511",
            "label": "多変量解析"
        },
        {
            "id": "GE20601",
            "label": "情報探索論"
        },
        {
            "id": "GE20701",
            "label": "質的調査法"
        },
        {
            "id": "GE20801",
            "label": "情報行動論"
        },
        {
            "id": "GE20901",
            "label": "知識発見基礎論"
        },
        {
            "id": "GE21001",
            "label": "知識資源組織化論"
        },
        {
            "id": "GE21101",
            "label": "データベース概説"
        },
        {
            "id": "GE21201",
            "label": "コンピュータシステムとネットワーク"
        },
        {
            "id": "GE21301",
            "label": "自然言語解析基礎"
        },
        {
            "id": "GE21401",
            "label": "メディア社会学"
        },
        {
            "id": "GE21601",
            "label": "公共経済学"
        },
        {
            "id": "GE21701",
            "label": "生涯学習と図書館"
        },
        {
            "id": "GE21812",
            "label": "テクスト解釈-1"
        },
        {
            "id": "GE21822",
            "label": "テクスト解釈-2"
        },
        {
            "id": "GE21832",
            "label": "テクスト解釈-3"
        },
        {
            "id": "GE22001",
            "label": "図書館概論"
        },
        {
            "id": "GE22101",
            "label": "経営・組織論"
        },
        {
            "id": "GE40201",
            "label": "学習指導と学校図書館"
        },
        {
            "id": "GE40301",
            "label": "学校図書館メディアの構成"
        },
        {
            "id": "GE40401",
            "label": "読書と豊かな人間性"
        },
        {
            "id": "GE40501",
            "label": "情報メディアの活用"
        },
        {
            "id": "GE40603",
            "label": "インターンシップ"
        },
        {
            "id": "GE50501",
            "label": "知識情報特論III"
        },
        {
            "id": "GE50601",
            "label": "知識情報特論IV"
        },
        {
            "id": "GE50712",
            "label": "専門英語B-1"
        },
        {
            "id": "GE50722",
            "label": "専門英語B-2"
        },
        {
            "id": "GE50732",
            "label": "専門英語B-3"
        },
        {
            "id": "GE50812",
            "label": "専門英語C-1"
        },
        {
            "id": "GE50822",
            "label": "専門英語C-2"
        },
        {
            "id": "GE50832",
            "label": "専門英語C-3"
        },
        {
            "id": "GE51018",
            "label": "卒業研究"
        },
        {
            "id": "GE60103",
            "label": "知識科学実習"
        },
        {
            "id": "GE60201",
            "label": "テクニカルコミュニケーション"
        },
        {
            "id": "GE60501",
            "label": "知識論"
        },
        {
            "id": "GE60601",
            "label": "知識形成論"
        },
        {
            "id": "GE60701",
            "label": "レファレンスサイエンス"
        },
        {
            "id": "GE60801",
            "label": "学術メディア論"
        },
        {
            "id": "GE61001",
            "label": "コミュニティ情報論"
        },
        {
            "id": "GE61101",
            "label": "図書館建築論"
        },
        {
            "id": "GE61201",
            "label": "知識構造化法"
        },
        {
            "id": "GE61301",
            "label": "情報評価"
        },
        {
            "id": "GE61501",
            "label": "データマイニング"
        },
        {
            "id": "GE61701",
            "label": "サイエンスコミュニケーション"
        },
        {
            "id": "GE62001",
            "label": "生命情報学"
        },
        {
            "id": "GE62101",
            "label": "知識コミュニケーション"
        },
        {
            "id": "GE62201",
            "label": "メディア社会文化論"
        },
        {
            "id": "GE62301",
            "label": "ソーシャルメディア分析"
        },
        {
            "id": "GE70103",
            "label": "知識情報システム実習"
        },
        {
            "id": "GE70201",
            "label": "情報サービスシステム"
        },
        {
            "id": "GE70301",
            "label": "ディジタルドキュメント"
        },
        {
            "id": "GE70401",
            "label": "ディジタルライブラリ"
        },
        {
            "id": "GE70501",
            "label": "情報検索システム"
        },
        {
            "id": "GE70601",
            "label": "Webプログラミング"
        },
        {
            "id": "GE70701",
            "label": "マルチメディアシステム"
        },
        {
            "id": "GE70801",
            "label": "データ表現と処理"
        },
        {
            "id": "GE70901",
            "label": "データベース技術"
        },
        {
            "id": "GE71001",
            "label": "情報デザインとインタフェース"
        },
        {
            "id": "GE71201",
            "label": "知識資源の分析"
        },
        {
            "id": "GE71301",
            "label": "知識資源の記述"
        },
        {
            "id": "GE71501",
            "label": "クラウドコンピューティング"
        },
        {
            "id": "GE71701",
            "label": "テキスト処理"
        },
        {
            "id": "GE71801",
            "label": "データ構造とアルゴリズム"
        },
        {
            "id": "GE72001",
            "label": "ソフトウェア工学"
        },
        {
            "id": "GE72201",
            "label": "アーカイブズの利用"
        },
        {
            "id": "GE72402",
            "label": "ディジタルキュレーション"
        },
        {
            "id": "GE72501",
            "label": "メディアアート"
        },
        {
            "id": "GE80103",
            "label": "情報資源経営実習"
        },
        {
            "id": "GE80201",
            "label": "図書館論"
        },
        {
            "id": "GE80301",
            "label": "学術情報基盤論"
        },
        {
            "id": "GE80401",
            "label": "経営情報システム論"
        },
        {
            "id": "GE80501",
            "label": "情報サービス経営論"
        },
        {
            "id": "GE80801",
            "label": "情報サービス構成論"
        },
        {
            "id": "GE80901",
            "label": "コレクションとアクセス"
        },
        {
            "id": "GE81001",
            "label": "教育文化政策"
        },
        {
            "id": "GE81201",
            "label": "学校図書館論"
        },
        {
            "id": "GE81301",
            "label": "情報法"
        },
        {
            "id": "GE81401",
            "label": "知的財産権論A"
        },
        {
            "id": "GE81901",
            "label": "図書館文化史論"
        },
        {
            "id": "GE82001",
            "label": "中国図書学"
        },
        {
            "id": "GE82101",
            "label": "日本図書学"
        },
        {
            "id": "GE82201",
            "label": "アーカイブズの構築"
        },
        {
            "id": "GE82501",
            "label": "映像メディア論"
        },
        {
            "id": "GE82601",
            "label": "パブリックガバナンス"
        }
    ],
    "2016": [
        {
            "id": "1320013",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320023",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320033",
            "label": "情報リテラシ実習"
        },
        {
            "id": "1320043",
            "label": "情報リテラシ実習"
        },
        {
            "id": "GA10101",
            "label": "情報社会と法制度"
        },
        {
            "id": "GA10201",
            "label": "知的財産概論"
        },
        {
            "id": "GE10101",
            "label": "知識情報概論"
        },
        {
            "id": "GE10201",
            "label": "哲学"
        },
        {
            "id": "GE10301",
            "label": "情報基礎"
        },
        {
            "id": "GE10413",
            "label": "情報基礎実習-1"
        },
        {
            "id": "GE10423",
            "label": "情報基礎実習-2"
        },
        {
            "id": "GE10612",
            "label": "プログラミング演習I-1"
        },
        {
            "id": "GE10622",
            "label": "プログラミング演習I-2"
        },
        {
            "id": "GE10712",
            "label": "プログラミング演習II-1"
        },
        {
            "id": "GE10722",
            "label": "プログラミング演習II-2"
        },
        {
            "id": "GE10732",
            "label": "プログラミング演習II-3"
        },
        {
            "id": "GE10801",
            "label": "情報数学"
        },
        {
            "id": "GE10911",
            "label": "統計"
        },
        {
            "id": "GE11012",
            "label": "知識情報演習I-1"
        },
        {
            "id": "GE11022",
            "label": "知識情報演習I-2"
        },
        {
            "id": "GE11112",
            "label": "知識情報演習II-1"
        },
        {
            "id": "GE11122",
            "label": "知識情報演習II-2"
        },
        {
            "id": "GE11212",
            "label": "知識情報演習III-1"
        },
        {
            "id": "GE11222",
            "label": "知識情報演習III-2"
        },
        {
            "id": "GE11512",
            "label": "専門英語A-1"
        },
        {
            "id": "GE11522",
            "label": "専門英語A-2"
        },
        {
            "id": "GE11532",
            "label": "専門英語A-3"
        },
        {
            "id": "GE11542",
            "label": "専門英語A-4"
        },
        {
            "id": "GE20101",
            "label": "情報システム概説"
        },
        {
            "id": "GE20201",
            "label": "基礎数学A"
        },
        {
            "id": "GE20301",
            "label": "基礎数学B"
        },
        {
            "id": "GE20401",
            "label": "量的調査法"
        },
        {
            "id": "GE20511",
            "label": "多変量解析"
        },
        {
            "id": "GE20601",
            "label": "情報探索論"
        },
        {
            "id": "GE20701",
            "label": "質的調査法"
        },
        {
            "id": "GE20801",
            "label": "情報行動論"
        },
        {
            "id": "GE20901",
            "label": "知識発見基礎論"
        },
        {
            "id": "GE21001",
            "label": "知識資源組織化論"
        },
        {
            "id": "GE21101",
            "label": "データベース概説"
        },
        {
            "id": "GE21201",
            "label": "コンピュータシステムとネットワーク"
        },
        {
            "id": "GE21301",
            "label": "自然言語解析基礎"
        },
        {
            "id": "GE21401",
            "label": "メディア社会学"
        },
        {
            "id": "GE21601",
            "label": "公共経済学"
        },
        {
            "id": "GE21701",
            "label": "生涯学習と図書館"
        },
        {
            "id": "GE21812",
            "label": "テクスト解釈-1"
        },
        {
            "id": "GE21822",
            "label": "テクスト解釈-2"
        },
        {
            "id": "GE21832",
            "label": "テクスト解釈-3"
        },
        {
            "id": "GE22001",
            "label": "図書館概論"
        },
        {
            "id": "GE22101",
            "label": "経営・組織論"
        },
        {
            "id": "GE31023",
            "label": "知的探求の世界I-2"
        },
        {
            "id": "GE40201",
            "label": "学習指導と学校図書館"
        },
        {
            "id": "GE40301",
            "label": "学校図書館メディアの構成"
        },
        {
            "id": "GE40401",
            "label": "読書と豊かな人間性"
        },
        {
            "id": "GE40501",
            "label": "情報メディアの活用"
        },
        {
            "id": "GE40603",
            "label": "インターンシップ"
        },
        {
            "id": "GE50301",
            "label": "知識情報特論I"
        },
        {
            "id": "GE50401",
            "label": "知識情報特論II"
        },
        {
            "id": "GE50712",
            "label": "専門英語B-1"
        },
        {
            "id": "GE50722",
            "label": "専門英語B-2"
        },
        {
            "id": "GE50732",
            "label": "専門英語B-3"
        },
        {
            "id": "GE50812",
            "label": "専門英語C-1"
        },
        {
            "id": "GE50822",
            "label": "専門英語C-2"
        },
        {
            "id": "GE50832",
            "label": "専門英語C-3"
        },
        {
            "id": "GE51018",
            "label": "卒業研究"
        },
        {
            "id": "GE60103",
            "label": "知識科学実習"
        },
        {
            "id": "GE60201",
            "label": "テクニカルコミュニケーション"
        },
        {
            "id": "GE60301",
            "label": "医療情報論"
        },
        {
            "id": "GE60401",
            "label": "特許情報論"
        },
        {
            "id": "GE60501",
            "label": "知識論"
        },
        {
            "id": "GE60601",
            "label": "知識形成論"
        },
        {
            "id": "GE60801",
            "label": "学術メディア論"
        },
        {
            "id": "GE61001",
            "label": "コミュニティ情報論"
        },
        {
            "id": "GE61201",
            "label": "知識構造化法"
        },
        {
            "id": "GE61301",
            "label": "情報評価"
        },
        {
            "id": "GE61501",
            "label": "データマイニング"
        },
        {
            "id": "GE61701",
            "label": "サイエンスコミュニケーション"
        },
        {
            "id": "GE62001",
            "label": "生命情報学"
        },
        {
            "id": "GE62101",
            "label": "知識コミュニケーション"
        },
        {
            "id": "GE62201",
            "label": "メディア社会文化論"
        },
        {
            "id": "GE62301",
            "label": "ソーシャルメディア分析"
        },
        {
            "id": "GE70103",
            "label": "知識情報システム実習"
        },
        {
            "id": "GE70201",
            "label": "情報サービスシステム"
        },
        {
            "id": "GE70301",
            "label": "ディジタルドキュメント"
        },
        {
            "id": "GE70401",
            "label": "ディジタルライブラリ"
        },
        {
            "id": "GE70501",
            "label": "情報検索システム"
        },
        {
            "id": "GE70601",
            "label": "Webプログラミング"
        },
        {
            "id": "GE70701",
            "label": "マルチメディアシステム"
        },
        {
            "id": "GE70801",
            "label": "データ表現と処理"
        },
        {
            "id": "GE70901",
            "label": "データベース技術"
        },
        {
            "id": "GE71001",
            "label": "情報デザインとインタフェス"
        },
        {
            "id": "GE71201",
            "label": "知識資源の分析"
        },
        {
            "id": "GE71301",
            "label": "知識資源の記述"
        },
        {
            "id": "GE71501",
            "label": "クラウドコンピューティン"
        },
        {
            "id": "GE71701",
            "label": "テキスト処理"
        },
        {
            "id": "GE71801",
            "label": "データ構造とアルゴリズム"
        },
        {
            "id": "GE72001",
            "label": "ソフトウェア工学"
        },
        {
            "id": "GE72201",
            "label": "アーカイブズの利用"
        },
        {
            "id": "GE72402",
            "label": "ディジタルキュレーション"
        },
        {
            "id": "GE72501",
            "label": "メディアアート"
        },
        {
            "id": "GE80103",
            "label": "情報資源経営実習"
        },
        {
            "id": "GE80201",
            "label": "図書館論"
        },
        {
            "id": "GE80301",
            "label": "学術情報基盤論"
        },
        {
            "id": "GE80401",
            "label": "経営情報システム論"
        },
        {
            "id": "GE80501",
            "label": "情報サービス経営論"
        },
        {
            "id": "GE80601",
            "label": "情報経済論"
        },
        {
            "id": "GE80801",
            "label": "情報サービス構成論"
        },
        {
            "id": "GE80901",
            "label": "コレクションとアクセス"
        },
        {
            "id": "GE81001",
            "label": "教育文化政策"
        },
        {
            "id": "GE81101",
            "label": "メディア教育の実践と評価"
        },
        {
            "id": "GE81201",
            "label": "学校図書館論"
        },
        {
            "id": "GE81301",
            "label": "情報法"
        },
        {
            "id": "GE81401",
            "label": "知的財産権論A"
        },
        {
            "id": "GE81901",
            "label": "図書館文化史論"
        },
        {
            "id": "GE82001",
            "label": "中国図書学"
        },
        {
            "id": "GE82101",
            "label": "日本図書学"
        },
        {
            "id": "GE82201",
            "label": "アーカイブズの構築"
        },
        {
            "id": "GE82501",
            "label": "映像メディア論"
        },
        {
            "id": "GE82601",
            "label": "パブリックガバナンス"
        }
    ]
};

export default SearchDistribution;
